Цель задания: Научиться самостоятельно работать с БД.
Задание: Создать новую БД. Таблицы: 
1. Паспорт. Поля: идентификатор, номер, серия, кем выдан, когда выдан, код подразделения
2. Гражданин. Поля: идентификатор, фамилия, имя, отчество, дата рождения. 
Поле идентификатор в таблице Гражданин ссылается на идентификатор в таблице Паспорт (связь 1 - к - 1)

=======================================================

use personbk_synergy;
create table passport (
id int primary key auto_increment,
room int,
seriya int,
kem_vidan varchar(50),
kogda_vidan date,
kod_podrazdeleniya int  
);
insert into passport values
(1, 111111, '1111', 'Московским РОВД г.Пермь', '2009.09.09', 111),
(2, 222222, '2222', 'Железнодорожным  РОВД г.Мурманск', '2009.09.09', 222),
(3, 333333, '3333', 'Северным РОВД г.Орел', '2009.09.09', 333),
(4, 444444, '4444', 'Ленинским РОВД г.Санкт-Петербург', '2009.09.09', 444),
(5, 555555, '5555', 'Володарсикм РОВД г.Москва', '2009.09.09', 555),
(6, 666666, '6666', 'Володарсикм РОВД г.Краснодар', '2009.09.09', 666),
(7, 777777, '7777', 'Володарсикм РОВД г.Брянск', '2009.09.09', 777);
create table citizen (
id int primary key,
lastname varchar(50),
name varchar(50),
middlename varchar(50),
dateBD date,
foreign key (id) references passport(id)
);
insert into citizen values
(1, 'Корсаков', 'Павел', 'Викторович', '1981.09.09'),
(2, 'Страдивари', 'Антонио', 'Мухомедзянов', '1978.09.09'),
(3, 'Дудкин', 'Валерий', 'Георгиевич', '2000.09.09'),
(4, 'Трубников', 'Максим', 'Валериевич', '1999.09.09'),
(5, 'Богданов', 'Исмаил', 'Исмаилович-Оглы', '1984.09.09'),
(6, 'Терещенко', 'Павел', 'Максимович', '1977.09.09'),
(7, 'Самородова', 'Екатерина', 'Владимировна', '1987.09.09');

-- select * from passport, citizen;
select * from passport;
select * from citizen;

========================================================

3. Квартира. Поля: идентификатор, полный адрес, владелец. Поле владелец в таблице Квартира 
ссылается на идентификатор в таблице Гражданин (связь 1- к - n)

***************************************************************************

use personbk_synergy;
create table citizen
(
  id INT PRIMARY KEY AUTO_INCREMENT,
  lastname varchar(50),
  name varchar(50),
  middlename varchar(50),
  dateBD date 
);
insert into citizen (lastname, name, middlename, dateBD) values
('Корсаков', 'Павел', 'Викторович', '1981.09.09'),
('Страдивари', 'Антонио', 'Мухомедзянов', '1978.09.09'),
('Дудкин', 'Валерий', 'Георгиевич', '2000.09.09'),
('Трубников', 'Максим', 'Валериевич', '1999.09.09'),
('Богданов', 'Исмаил', 'Исмаилович-Оглы', '1984.09.09'),
('Терещенко', 'Павел', 'Максимович', '1977.09.09'),
('Самородова', 'Екатерина', 'Владимировна', '1987.09.09');

create table apartment
(
  id int primary key auto_increment,
  address varchar(150),
  owner_user varchar(50),
  lastname_id int,
  foreign key (lastname_id) references citizen (id)
);
insert into apartment (address, owner_user) values
('ул.Дмитрия Донского 12', 'Корсаков'),
('ул.Смитного 66', 'Страдивари'),
('ул.Привокзальная', 'Дудкин'),
('ул.Красногвардейская 143', 'Трубников'),
('ул.Мира 5', 'Богданов'),
('пл.Маршала Жукова 67', 'Терещенко'),
('ул.Сикорского 82', 'Самородова');

select * from citizen;
select * from apartment;

********************************************************************

==============================================================================================

4. Домашние животные. Поля: идентификатор, кличка, порода, тип, хозяин. 
Поле хозяин в таблице Домашние животные ссылкается на идентификатор в таблице Гражданин (связь 1- к - n)
 Студент должен самостоятельно определить тип поля, какие поля выделить в первичный ключ, а по каким полям сделать индексы. 
Также привести небольшое описание, почему по данному полю сделан индекс.

Почему я выбрал Имя? Собаки разумные животные и они тоже знают как нас зовут )

create table if not exists citizen
(
  id INT PRIMARY KEY AUTO_INCREMENT,
  lastname varchar(50),
  name varchar(50),
  middlename varchar(50),
  dateBD date 
);
insert into citizen (lastname, name, middlename, dateBD) values
('Корсаков', 'Павел', 'Викторович', '1981.09.09'),
('Страдивари', 'Антонио', 'Мухомедзянов', '1978.09.09'),
('Дудкин', 'Валерий', 'Георгиевич', '2000.09.09'),
('Трубников', 'Максим', 'Валериевич', '1999.09.09'),
('Богданов', 'Исмаил', 'Исмаилович-Оглы', '1984.09.09'),
('Терещенко', 'Павел', 'Максимович', '1977.09.09'),
('Самородова', 'Екатерина', 'Владимировна', '1987.09.09');

create table if not exists animals
(
  id INT PRIMARY KEY AUTO_INCREMENT,
  klichka varchar(150),
  poroda varchar(150),
  tip varchar(150),
  hozyain varchar(150),
  name_id int,
  foreign key (name_id) references citizen (id)
);
insert into animals (klichka, poroda, tip, hozyain) values
('Патрик', 'Абиссинская', 'Кот', 'Корсаков'),
('Милман', 'Енот', 'Енот', 'Страдивари'),
('Космос', 'Австралийский мист', 'Кот', 'Дудкин'),
('Ракета', 'Трионикс', 'Черепаха', 'Трубников'),
('Симба', 'Хомяки Робковского', 'Хомяк', 'Богданов'),
('Маршал', 'Доберман', 'Собака', 'Терещенко'),
('Искорка', 'Ангорка', 'Кошка', 'Самородова');


select * from citizen;
select * from animals;

***********************************************************************************
==============================================================



Создать еще одну БД. Таблицы:
1. Почтовые отделения. Поля: адрес, часы работы.
2. Работники. Поля: ФИО, паспортные данные, адрес проживания, номер трудовой книжки.
3. Посылки. Поля: вес, категория, трек номер. 
Необходимо создать связь между таблицами Почтовые отделения и Работники. Тип связи определить самостоятельно.

******************************************************************

use personbk_synergy;

create table if not exists post_offices
(
id INT PRIMARY KEY AUTO_INCREMENT,
address varchar(30),
time_open varchar(40)
);
insert into post_offices (address, time_open) values 
('ул. Семёнова, 47 Москва', '8:00-22:00'),
('ул. Семёнова, 48 Москва', '9:00-21:00'),
('ул. Вовы, 32 Санкт-Петербург', '8:30-22:30'),
('ул. Татьяны Б., 1 Ижевск', '9:00-21:00');

create table if not exists employee
(
id INT PRIMARY KEY AUTO_INCREMENT,
fio varchar(30),
passport int,
address varchar(30),
trud_knizhka int,
address_id int,
foreign key (address_id) references post_offices (id)
);
insert into employee (fio, passport, address, trud_knizhka) values 
('Корсаков Павел Викторович', '19818780909', 'ул.Дмитрия Донского 12, 47 Москва', '8002200'),
('Страдивари Антонио Мухомедзянов', '19818780909', 'ул. Семёнова, 47 Москва', '8002200'),
('Терещенко Павел Максимович', '19818780909', 'пл.Маршала Жукова 67, 47 Москва', '8002200'),
('Самородова Екатерина Владимировна', '19818780909','ул.Сикорского 82, 47 Москва', '8002200');

create table if not exists package
(
id INT PRIMARY KEY AUTO_INCREMENT,
weight int,
category varchar(40),
track_number int,
address_id int,
foreign key (address_id) references post_offices (id)
);
insert into package (weight, category, track_number) values 
('12', 'Одежда', '87865654002200'),
('31', 'Мебельная фурнитура', '87865658882200'),
('5', 'ул. Вовы, 32 Санкт-Петербург', '87899954002200'),
('21', 'Бытовая тхника', '87865654002000');


select * from post_offices;
select * from employee;
select * from package;

Что я сделал, к офису привязал сотрудников и какие категории товаров есть в каждом отделении почты 

=====================================
























drop database if exists clients;
create database if not exists clients;
use clients;
create table if not exists passport
(
  id int,
  room int,
  seriya int,
  kem_vidan varchar(50),
  kogda_vidan date,
  kod_podrazdeleniya int  
);
insert into passport values
(1, 111111, '1111', 'Московским РОВД г.Пермь', '2009.09.09', 111),
(2, 222222, '2222', 'Железнодорожным  РОВД г.Мурманск', '2009.09.09', 222),
(3, 333333, '3333', 'Северным РОВД г.Орел', '2009.09.09', 333),
(4, 444444, '4444', 'Ленинским РОВД г.Санкт-Петербург', '2009.09.09', 444),
(5, 555555, '5555', 'Володарсикм РОВД г.Москва', '2009.09.09', 555),
(6, 666666, '6666', 'Володарсикм РОВД г.Краснодар', '2009.09.09', 666),
(7, 777777, '7777', 'Володарсикм РОВД г.Брянск', '2009.09.09', 777);

select * from passport;

************************************

use clients;
create table if not exists citizen
(
  id int,
  lastname varchar(50),
  name varchar(50),
  middlename varchar(50),
  dateBD date 
);
insert into citizen values
(1, 'Корсаков', 'Павел', 'Викторович', '1981.09.09'),
(2, 'Страдивари', 'Антонио', 'Мухомедзянов', '1978.09.09'),
(3, 'Дудкин', 'Валерий', 'Георгиевич', '2000.09.09'),
(4, 'Трубников', 'Максим', 'Валериевич', '1999.09.09'),
(5, 'Богданов', 'Исмаил', 'Исмаилович-Оглы', '1984.09.09'),
(6, 'Терещенко', 'Павел', 'Максимович', '1977.09.09'),
(7, 'Самородова', 'Екатерина', 'Владимировна', '1987.09.09');

select * from citizen;

***********************************

use clients;
create table if not exists apartment
(
  id int,
  address varchar(150),
  owner_kv int
);
insert into apartment values
(1, 'ул.Дмитрия Донского 12', 'Корсаков'),
(2, 'ул.Смитного 66', 'Страдивари'),
(3, 'ул.Привокзальная', 'Дудкин'),
(4, 'ул.Красногвардейская 143', 'Трубников'),
(5, 'ул.Мира 5', 'Богданов'),
(6, 'пл.Маршала Жукова 67', 'Терещенко'),
(7, 'ул.Сикорского 82', 'Самородова');

select * from apartment;

*****************************************

use clients;
create table if not exists animals
(
  id int,
  klishka varchar(150),
  poroda varchar(150),
  tip varchar(150),
  hozyain varchar(150)
);
insert into animals values
(1, 'Патрик', 'Абиссинская', 'Кот', 'Корсаков'),
(2, 'Милман', 'Енот', 'Енот', 'Страдивари'),
(3, 'Космос', 'Австралийский мист', 'Кот', 'Дудкин'),
(4, 'Ракета', 'Трионикс', 'Черепаха', 'Трубников'),
(5, 'Симба', 'Хомяки Робковского', 'Хомяк', 'Богданов'),
(6, 'Маршал', 'Доберман', 'Собака', 'Терещенко'),
(7, 'Искорка', 'Ангорка', 'Кошка', 'Самородова');

select * from animals;

